# Importar Pandas
## sqlite3...   interfaz python para Sqlite

In [1]:
import pandas as pd
pd.set_option('display.max_columns',100)
pd.set_option('display.max_rows',100)
import sqlite3
print('complete...')

complete...

# Conectamos con la base de datos "Tutorial"
regresa clase Connection representado en con como una base de datos local.

In [2]:
con = sqlite3.connect("tutorial.db")

In [3]:
con

## y se crea un "cursor"... clase necesaria para introducir Instrucciones SQL

In [4]:
cur = con.cursor()

Veamos un ejemplo , que ejectua la SENTENCIA SQL utilizando el cursor que reci√©n creamos

In [5]:
cur.execute("CREATE TABLE movie(title, year, score)")

In [7]:
res = cur.execute("SELECT name FROM sqlite_master")
res.fetchone()

('movie',)

In [8]:
cur.execute("""
    INSERT INTO movie VALUES
        ('Monty Python and the Holy Grail', 1975, 8.2),
        ('And Now for Something Completely Different', 1971, 7.5)
""")
con.commit()

In [9]:
res = cur.execute("SELECT score FROM movie")
res.fetchall()

[(8.2,), (7.5,)]

In [10]:
data = [
    ("Monty Python Live at the Hollywood Bowl", 1982, 7.9),
    ("Monty Python's The Meaning of Life", 1983, 7.5),
    ("Monty Python's Life of Brian", 1979, 8.0),
]
cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data)
con.commit()  # Remember to commit the transaction after executing INSERT.

In [11]:
for row in cur.execute("SELECT year, title FROM movie ORDER BY year"):
    print(row)

(1971, 'And Now for Something Completely Different')
(1975, 'Monty Python and the Holy Grail')
(1979, "Monty Python's Life of Brian")
(1982, 'Monty Python Live at the Hollywood Bowl')
(1983, "Monty Python's The Meaning of Life")

In [13]:
con.close()

new_con = sqlite3.connect("tutorial.db")

new_cur = new_con.cursor()

res = new_cur.execute("SELECT title, year FROM movie ORDER BY score DESC")

title, year = res.fetchone()

print(f'The highest scoring Monty Python movie is {title!r}, released in {year}')

The highest scoring Monty Python movie is 'Monty Python and the Holy Grail', released in 1975

# Importar Pandas
## sqlite3...   interfaz python para Sqlite

In [12]:
# Importar Pandas
## sqlite3...   interfaz python para Sqlite

import pandas as pd
pd.set_option('display.max_columns',100)
pd.set_option('display.max_rows',100)
import sqlite3
print('complete...')

complete...

# Conectamos con la base de datos "Danny Diner"
y se crea un "cursor"... clase necesaria para introducir Instrucciones SQL

In [14]:
try:
    conn = sqlite3.connect('danny_diner.db') # # Creates connection to existing db or creates an empty db
    print('Connected successfully...')  
except Exception as e:
    print('Error during connection:', str(e))
else: 
    c = conn.cursor() # # Cursor allows SQL commands to be executed.

Connected successfully...

In [15]:
c.execute( '''
        CREATE TABLE sales (
          "customer_id" VARCHAR(1),
          "order_date" DATE,
          "product_id" INTEGER
        ); ''')

c.execute('''
        INSERT INTO sales
          ("customer_id", "order_date", "product_id")
        VALUES
          ('A', '2021-01-01', '1'),
          ('A', '2021-01-01', '2'),
          ('A', '2021-01-07', '2'),
          ('A', '2021-01-10', '3'),
          ('A', '2021-01-11', '3'),
          ('A', '2021-01-11', '3'),
          ('B', '2021-01-01', '2'),
          ('B', '2021-01-02', '2'),
          ('B', '2021-01-04', '1'),
          ('B', '2021-01-11', '1'),
          ('B', '2021-01-16', '3'),
          ('B', '2021-02-01', '3'),
          ('C', '2021-01-01', '3'),
          ('C', '2021-01-01', '3'),
          ('C', '2021-01-07', '3'); ''')

c.execute('''
        CREATE TABLE menu (
          "product_id" INTEGER,
          "product_name" VARCHAR(5),
          "price" INTEGER
        );''')

c.execute('''
        INSERT INTO menu
          ("product_id", "product_name", "price")
        VALUES
          ('1', 'sushi', '10'),
          ('2', 'curry', '15'),
          ('3', 'ramen', '12'); ''')

c.execute('''     
        CREATE TABLE members (
          "customer_id" VARCHAR(1),
          "join_date" DATE
        );''')

c.execute('''
        INSERT INTO members
          ("customer_id", "join_date")
        VALUES
          ('A', '2021-01-07'),
          ('B', '2021-01-09'); ''')
conn.commit()
print('complete...')

complete...


# /* --------------------
#   Case Study Questions
#   --------------------*/

-- 1. What is the total amount each customer spent at the restaurant <br/>
-- 2. How many days has each customer visited the restaurant? <br/>
-- 3. What was the first item from the menu purchased by each customer?<br/>
-- 4. What is the most purchased item on the menu and how many times was it purchased by all customers? <br/>
-- 5. Which item was the most popular for each customer? <br/>
-- 6. Which item was purchased first by the customer after they became a member? <br/>
-- 7. Which item was purchased just before the customer became a member? <br/>
-- 8. What is the total items and amount spent for each member before they became a member? <br/>
-- 9.  If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have? <br/>
-- 10. In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January? <br/>

-- Example Query:
SELECT
  	product_id,
    product_name,
    price
FROM dannys_diner.menu
ORDER BY price DESC
LIMIT 5;

In [18]:
#Example query
c.execute("SELECT product_id FROM menu ORDER BY price DESC LIMIT 5;")
c.fetchall()

[(2,), (3,), (1,)]

In [97]:
# Looking at all tables
pd.read_sql('''
     SELECT 
          name AS Table_Names 
     
     FROM 
          sqlite_master
''', conn)

  Table_Names
0       sales
1        menu
2     members

In [98]:
# 1. What is the total amount each customer spent at the restaurant
uno = pd.read_sql('''
     SELECT
          customer_id AS Customer,
          SUM(price) AS Total_Spent 
     
     FROM
          sales

     INNER JOIN 
          menu ON sales.product_id=menu.product_id

     GROUP BY 
          customer_id
''', conn)

plot()

  Customer  Total_Spent
0        A           76
1        B           74
2        C           36

In [99]:
# 2. How many days has each customer visited the restaurant?
pd.read_sql('''
     SELECT 
          customer_id AS Customer, 
          COUNT(DISTINCT(order_date)) AS Days_Visited 
     
     FROM
          sales

     GROUP BY
          customer_id
''', conn)

  Customer  Days_Visited
0        A             4
1        B             6
2        C             2

In [85]:
# 3. What was the first item from the menu purchased by each customer?
pd.read_sql('''
     SELECT
          customer_id AS Customer, 
          product_name AS First_Item 
     
     FROM 
          sales

     INNER JOIN 
          menu ON sales.product_id=menu.product_id

     GROUP BY 
          sales.customer_id

     ORDER BY
          order_date ASC
''', conn)

  Customer First_Item
0        A      sushi
1        B      curry
2        C      ramen

In [123]:
# 4. What is the most purchased item on the menu and,
pd.read_sql('''
  SELECT sales.product_id, COUNT(sales.product_id) AS Times_Purchased FROM sales
  GROUP BY sales.product_id
  ORDER BY Times_Purchased DESC
  LIMIT 1
''', conn)

   product_id  Times_Purchased
0           3                8

In [132]:
# How many times was it purchased by all customers?
pd.read_sql('''
  SELECT 
    customer_id AS Customer, 
    menu.product_name AS Product, 
    COUNT(sales.product_id) AS Times_Purchased FROM sales
  INNER JOIN menu ON sales.product_id=menu.product_id
  WHERE sales.product_id IN (
    SELECT product_id FROM (
      SELECT product_id, COUNT(product_id) AS Times_Purchased FROM sales
      GROUP BY product_id
      ORDER BY Times_Purchased DESC
      LIMIT 1
    )
  )
  GROUP BY customer_id
''', conn)

  Customer Product  Times_Purchased
0        A   ramen                3
1        B   ramen                2
2        C   ramen                3

In [172]:
# 5. Which item was the most popular for each customer?
pd.read_sql('''
SELECT
    Customer,
    Most_Popular_Product,
    Count_Product
FROM (
    SELECT
        customer_id AS Customer,
        menu.product_name AS Most_Popular_Product,
        COUNT(sales.product_id) AS Count_Product,
        RANK() OVER (PARTITION BY customer_id ORDER BY COUNT(sales.product_id) DESC) AS Popular_Rank
    FROM sales
    INNER JOIN menu ON sales.product_id = menu.product_id
    GROUP BY Customer, Most_Popular_Product
) ranked_products
WHERE Popular_Rank = 1;

''', conn)

  Customer Most_Popular_Product  Count_Product
0        A                ramen              3
1        B                sushi              2
2        B                ramen              2
3        B                curry              2
4        C                ramen              3

In [178]:
# 6. Which item was purchased first by the customer after they became a member?
pd.read_sql('''
     SELECT
          sales.customer_id AS Customer,
          menu.product_name AS First_Purchase,
          MIN(sales.order_date) AS First_Purchase_Date
     FROM sales
     INNER JOIN menu ON sales.product_id = menu.product_id
     INNER JOIN members ON sales.customer_id = members.customer_id
     WHERE sales.order_date >= members.join_date
     GROUP BY sales.customer_id
''', conn)

  Customer First_Purchase First_Purchase_Date
0        A          curry          2021-01-07
1        B          sushi          2021-01-11

In [184]:
# 7. Which item was purchased just before the customer became a member?
pd.read_sql('''
    SELECT
        sales.customer_id AS Customer,
        menu.product_name AS Last_Purchase,
        MAX(sales.order_date) AS Last_Purchase_Date
    FROM sales
    INNER JOIN menu ON sales.product_id = menu.product_id
    INNER JOIN members ON sales.customer_id = members.customer_id
    WHERE sales.order_date < members.join_date
    GROUP BY sales.customer_id
''', conn)

  Customer Last_Purchase Last_Purchase_Date
0        A         sushi         2021-01-01
1        B         sushi         2021-01-04

In [186]:
# 8. What is the total items and amount spent for each member before they became a member?
pd.read_sql('''
    SELECT
        members.customer_id AS Customer,
        COUNT(sales.product_id) AS Total_Items,
        SUM(menu.price) AS Total_Amount_Spent
    FROM members
    LEFT JOIN sales ON members.customer_id = sales.customer_id
    LEFT JOIN menu ON sales.product_id = menu.product_id
    WHERE sales.order_date < members.join_date
    GROUP BY members.customer_id
''',conn)

  Customer  Total_Items  Total_Amount_Spent
0        A            2                  25
1        B            3                  40

In [188]:
# 9.  If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?
pd.read_sql('''
SELECT
    sales.customer_id AS Customer,
    SUM(
        CASE
            WHEN menu.product_name = 'sushi' THEN (menu.price * 2) * 10
            ELSE menu.price * 10
        END
    ) AS Total_Points
FROM sales
INNER JOIN menu ON sales.product_id = menu.product_id
GROUP BY sales.customer_id
''',conn)

  Customer  Total_Points
0        A           860
1        B           940
2        C           360

In [197]:
# 10. In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?
pd.read_sql('''
SELECT
    mem.customer_id AS Customer,
    SUM(
        CASE
            WHEN s.order_date <= DATE(mem.join_date, '+7 days') THEN (m.price * 2) * 10
            ELSE m.price * 10
        END
    ) AS Total_Points
FROM members mem
LEFT JOIN sales s ON mem.customer_id = s.customer_id
LEFT JOIN menu m ON s.product_id = m.product_id
WHERE s.order_date <= '2023-01-31'
GROUP BY mem.customer_id

''', conn)

  Customer  Total_Points
0        A          1520
1        B          1360

## SOME Useful SQL commands,
### Investigar 

DENSE_RANK()
OVER()
PARTITION BY()
WHERE

https://www.youtube.com/watch?v=xlbSQJuHkRE